{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "ClapTextModelWithProjection",
    "parent_library": "transformers.models.clap.modeling_clap"
  },
  "base_model_name_or_path": "/home/2019111986/.cache/huggingface/hub/models--cvssp--audioldm-s-full-v2/snapshots/feeb3d14203495a4b6ac0893cbdedb2159b4819c/text_encoder",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": "gaussian",
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 8,
  "lora_dropout": 0.0,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 1,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "text_model.encoder.layer.2.attention.self.query",
    "text_model.encoder.layer.7.attention.self.query",
    "text_model.encoder.layer.10.attention.self.query",
    "text_model.encoder.layer.3.attention.self.query",
    "text_model.encoder.layer.11.attention.self.value",
    "text_model.encoder.layer.9.attention.self.query",
    "text_model.encoder.layer.11.attention.self.query",
    "text_model.encoder.layer.0.attention.self.value",
    "text_model.encoder.layer.1.attention.self.value",
    "text_model.encoder.layer.7.attention.self.value",
    "text_model.encoder.layer.2.attention.self.value",
    "text_model.encoder.layer.10.attention.self.value",
    "text_model.encoder.layer.3.attention.self.value",
    "text_model.encoder.layer.5.attention.self.value",
    "text_model.encoder.layer.9.attention.self.value",
    "text_model.encoder.layer.1.attention.self.query",
    "text_model.encoder.layer.0.attention.self.query",
    "text_model.encoder.layer.6.attention.self.value",
    "text_model.encoder.layer.8.attention.self.value",
    "text_model.encoder.layer.4.attention.self.value",
    "text_model.encoder.layer.5.attention.self.query",
    "text_model.encoder.layer.4.attention.self.query",
    "text_model.encoder.layer.8.attention.self.query",
    "text_model.encoder.layer.6.attention.self.query"
  ],
  "task_type": null
}